<?xml version="1.0" ?>
<net batch="1" name="pnet_73x104" version="2">
	<layers>
		<layer id="0" name="input" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>104</dim>
					<dim>73</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="pnet/conv1/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="10" pad-b="0" pad-r="0" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>104</dim>
					<dim>73</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>10</dim>
					<dim>102</dim>
					<dim>71</dim>
				</port>
			</output>
			<blobs>
				<weights offset="384" size="1080"/>
				<biases offset="1464" size="40"/>
			</blobs>
		</layer>
		<layer id="2" name="pnet/PReLU1/MaxPool_1" precision="FP32" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel-x="1" kernel-y="1" pad-b="0" pad-r="0" pad-x="0" pad-y="0" pool-method="max" rounding-type="floor" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>102</dim>
					<dim>71</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>10</dim>
					<dim>102</dim>
					<dim>71</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="pnet/PReLU1/Mul" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>102</dim>
					<dim>71</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>10</dim>
					<dim>102</dim>
					<dim>71</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1504" size="40"/>
				<biases offset="1544" size="40"/>
			</blobs>
		</layer>
		<layer id="4" name="pnet/PReLU1/Relu_1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>102</dim>
					<dim>71</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>10</dim>
					<dim>102</dim>
					<dim>71</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="pnet/PReLU1/MaxPool_2" precision="FP32" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel-x="1" kernel-y="1" pad-b="0" pad-r="0" pad-x="0" pad-y="0" pool-method="max" rounding-type="floor" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>102</dim>
					<dim>71</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>10</dim>
					<dim>102</dim>
					<dim>71</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="pnet/PReLU1/Mul_2" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>102</dim>
					<dim>71</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>10</dim>
					<dim>102</dim>
					<dim>71</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1584" size="40"/>
				<biases offset="1624" size="40"/>
			</blobs>
		</layer>
		<layer id="7" name="pnet/PReLU1/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel-x="1" kernel-y="1" pad-b="0" pad-r="0" pad-x="0" pad-y="0" pool-method="max" rounding-type="floor" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>102</dim>
					<dim>71</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>10</dim>
					<dim>102</dim>
					<dim>71</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="pnet/PReLU1/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>102</dim>
					<dim>71</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>10</dim>
					<dim>102</dim>
					<dim>71</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="pnet/PReLU1/Add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>102</dim>
					<dim>71</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>10</dim>
					<dim>102</dim>
					<dim>71</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>10</dim>
					<dim>102</dim>
					<dim>71</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="pnet/pool1" precision="FP32" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel-x="2" kernel-y="2" pad-b="0" pad-r="1" pad-x="0" pad-y="0" pool-method="max" rounding-type="floor" stride="1,1,2,2" stride-x="2" stride-y="2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>102</dim>
					<dim>71</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>10</dim>
					<dim>51</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="pnet/conv2/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="16" pad-b="0" pad-r="0" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>51</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>49</dim>
					<dim>34</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1664" size="5760"/>
				<biases offset="7424" size="64"/>
			</blobs>
		</layer>
		<layer id="12" name="pnet/PReLU2/MaxPool_1" precision="FP32" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel-x="1" kernel-y="1" pad-b="0" pad-r="0" pad-x="0" pad-y="0" pool-method="max" rounding-type="floor" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>49</dim>
					<dim>34</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>49</dim>
					<dim>34</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="pnet/PReLU2/Mul" precision="FP32" type="ScaleShift">
			<input>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>49</dim>
					<dim>34</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>49</dim>
					<dim>34</dim>
				</port>
			</output>
			<blobs>
				<weights offset="320" size="64"/>
				<biases offset="7488" size="64"/>
			</blobs>
		</layer>
		<layer id="14" name="pnet/PReLU2/Relu_1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>49</dim>
					<dim>34</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>49</dim>
					<dim>34</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="pnet/PReLU2/MaxPool_2" precision="FP32" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel-x="1" kernel-y="1" pad-b="0" pad-r="0" pad-x="0" pad-y="0" pool-method="max" rounding-type="floor" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>49</dim>
					<dim>34</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>49</dim>
					<dim>34</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="pnet/PReLU2/Mul_2" precision="FP32" type="ScaleShift">
			<input>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>49</dim>
					<dim>34</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>49</dim>
					<dim>34</dim>
				</port>
			</output>
			<blobs>
				<weights offset="256" size="64"/>
				<biases offset="7552" size="64"/>
			</blobs>
		</layer>
		<layer id="17" name="pnet/PReLU2/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel-x="1" kernel-y="1" pad-b="0" pad-r="0" pad-x="0" pad-y="0" pool-method="max" rounding-type="floor" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>49</dim>
					<dim>34</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>49</dim>
					<dim>34</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="pnet/PReLU2/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>49</dim>
					<dim>34</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>49</dim>
					<dim>34</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="pnet/PReLU2/Add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>49</dim>
					<dim>34</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>49</dim>
					<dim>34</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>49</dim>
					<dim>34</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="pnet/conv3/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="32" pad-b="0" pad-r="0" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>49</dim>
					<dim>34</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7616" size="18432"/>
				<biases offset="26048" size="128"/>
			</blobs>
		</layer>
		<layer id="21" name="pnet/PReLU3/MaxPool_1" precision="FP32" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel-x="1" kernel-y="1" pad-b="0" pad-r="0" pad-x="0" pad-y="0" pool-method="max" rounding-type="floor" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="pnet/PReLU3/Mul" precision="FP32" type="ScaleShift">
			<input>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="128" size="128"/>
				<biases offset="26176" size="128"/>
			</blobs>
		</layer>
		<layer id="23" name="pnet/PReLU3/Relu_1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="pnet/PReLU3/MaxPool_2" precision="FP32" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel-x="1" kernel-y="1" pad-b="0" pad-r="0" pad-x="0" pad-y="0" pool-method="max" rounding-type="floor" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="pnet/PReLU3/Mul_2" precision="FP32" type="ScaleShift">
			<input>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="128"/>
				<biases offset="26304" size="128"/>
			</blobs>
		</layer>
		<layer id="26" name="pnet/PReLU3/MaxPool" precision="FP32" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel-x="1" kernel-y="1" pad-b="0" pad-r="0" pad-x="0" pad-y="0" pool-method="max" rounding-type="floor" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="pnet/PReLU3/Relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="pnet/PReLU3/Add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="pnet/conv4-1/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="2" pad-b="0" pad-r="0" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>47</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="26432" size="256"/>
				<biases offset="26688" size="8"/>
			</blobs>
		</layer>
		<layer id="30" name="pnet/conv4-2/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="4" pad-b="0" pad-r="0" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>47</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="26696" size="512"/>
				<biases offset="27208" size="16"/>
			</blobs>
		</layer>
		<layer id="31" name="pnet/output0" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>47</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>4</dim>
					<dim>47</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>6</dim>
					<dim>47</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="pnet/output" precision="FP32" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel-x="1" kernel-y="1" pad-b="0" pad-r="0" pad-x="0" pad-y="0" pool-method="max" rounding-type="floor" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>47</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>6</dim>
					<dim>47</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
		<edge from-layer="1" from-port="3" to-layer="2" to-port="0"/>
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0"/>
		<edge from-layer="3" from-port="3" to-layer="4" to-port="0"/>
		<edge from-layer="4" from-port="1" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="1" to-layer="6" to-port="0"/>
		<edge from-layer="1" from-port="3" to-layer="7" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="8" to-port="0"/>
		<edge from-layer="6" from-port="3" to-layer="9" to-port="0"/>
		<edge from-layer="8" from-port="1" to-layer="9" to-port="1"/>
		<edge from-layer="9" from-port="2" to-layer="10" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="11" to-port="0"/>
		<edge from-layer="11" from-port="3" to-layer="12" to-port="0"/>
		<edge from-layer="12" from-port="1" to-layer="13" to-port="1"/>
		<edge from-layer="13" from-port="3" to-layer="14" to-port="0"/>
		<edge from-layer="14" from-port="1" to-layer="15" to-port="0"/>
		<edge from-layer="15" from-port="1" to-layer="16" to-port="1"/>
		<edge from-layer="11" from-port="3" to-layer="17" to-port="0"/>
		<edge from-layer="17" from-port="1" to-layer="18" to-port="0"/>
		<edge from-layer="16" from-port="3" to-layer="19" to-port="0"/>
		<edge from-layer="18" from-port="1" to-layer="19" to-port="1"/>
		<edge from-layer="19" from-port="2" to-layer="20" to-port="0"/>
		<edge from-layer="20" from-port="3" to-layer="21" to-port="0"/>
		<edge from-layer="21" from-port="1" to-layer="22" to-port="1"/>
		<edge from-layer="22" from-port="3" to-layer="23" to-port="0"/>
		<edge from-layer="23" from-port="1" to-layer="24" to-port="0"/>
		<edge from-layer="24" from-port="1" to-layer="25" to-port="1"/>
		<edge from-layer="20" from-port="3" to-layer="26" to-port="0"/>
		<edge from-layer="26" from-port="1" to-layer="27" to-port="0"/>
		<edge from-layer="25" from-port="3" to-layer="28" to-port="0"/>
		<edge from-layer="27" from-port="1" to-layer="28" to-port="1"/>
		<edge from-layer="28" from-port="2" to-layer="29" to-port="0"/>
		<edge from-layer="28" from-port="2" to-layer="30" to-port="0"/>
		<edge from-layer="29" from-port="3" to-layer="31" to-port="0"/>
		<edge from-layer="30" from-port="3" to-layer="31" to-port="1"/>
		<edge from-layer="31" from-port="2" to-layer="32" to-port="0"/>
	</edges>
</net>
